package com.example.a123.repository

import com.example.a123.model.Tip

class TipRepository {

    private val tips = listOf(
        Tip(1, "Важность осознания своих эмоций. Научитесь отслеживать свои чувства и понимать, что с вами происходит в моменты стресса или тревоги. Это помогает не только осознанно реагировать на ситуации, но и находить эффективные способы управления своим эмоциональным состоянием, такие как глубокое дыхание или медитация."),
        Tip(2, "Сила позитивного мышления. Практикуйте позитивное мышление, чтобы изменить восприятие трудных ситуаций. Заменяйте негативные мысли на конструктивные и позитивные утверждения. Это помогает уменьшить уровень стресса и повысить уверенность в себе."),
        Tip(3, "Умение устанавливать границы. Важно уметь говорить 'нет' и защищать свои личные границы. Это не эгоизм, а забота о собственном психическом здоровье. Уважение своих нужд и потребностей помогает избежать эмоционального выгорания и усталости."),
        Tip(4, "Практика благодарности. Каждое утро или вечер выделяйте несколько минут, чтобы записать 3 вещи, за которые вы благодарны. Это простое упражнение помогает переключить внимание на позитивные моменты в жизни, повышая уровень счастья и уменьшая беспокойство."),
        Tip(5, "Слушайте свое тело. Психологическое и физическое здоровье неразрывно связаны. Если вы чувствуете усталость, напряжение или беспокойство, делайте перерывы, расслабляйтесь, занимайтесь физической активностью. Прогулки на свежем воздухе или йога могут существенно снизить уровень стресса."),
        Tip(6, "Самоосознанность и рефлексия. Регулярно уделяйте время для размышлений о том, что произошло в вашей жизни за день. Анализируйте свои действия, эмоции и реакции. Это поможет вам лучше понять себя, выявить скрытые мотивы и научиться эффективнее управлять своими поступками и чувствами."),
        Tip(7, "Не сравнивайте себя с другими. Каждый человек уникален, и его путь в жизни отличается от вашего. Сравнение себя с другими может привести к чувству неполноценности и зависти. Вместо этого сосредоточьтесь на собственном прогрессе и достижениях, цените свои сильные стороны и индивидуальность."),
        Tip(8, "Учитесь прощать. Накопленные обиды могут серьезно влиять на ваше эмоциональное состояние. Прощение — это не оправдание действий другого человека, а способ освободить себя от тяжелых эмоций. Это поможет вам двигаться вперед и сохранить внутреннюю гармонию."),
        Tip(9, "Психологическая гибкость. В жизни часто случаются неожиданные повороты. Научитесь адаптироваться и находить позитивные моменты в любых ситуациях. Важно научиться отпускать старые ожидания и открыться новым возможностям."),
        Tip(10, "Забота о себе — это не эгоизм. Регулярное время для себя, будь то прогулка, увлечение или просто отдых, помогает восстановить силы и быть более продуктивным в долгосрочной перспективе. Забота о своем психоэмоциональном здоровье позволяет быть лучшей версией себя для других."),
        Tip(11, "Настройка на успех. Когда вы начинаете новую задачу, создавайте в себе уверенность, что вы способны её выполнить. Мысленно представляйте, как вы успешно справляетесь с трудностями. Это помогает укрепить мотивацию и снизить страх перед неудачей."),
        Tip(12, "Не избегайте трудных разговоров. Важно научиться вести откровенные беседы даже в сложных ситуациях. Конфликты и недопонимания можно разрешить, если подойти к ним с открытым и спокойным умом. Понимание и уважение друг друга часто помогает укрепить отношения."),
        Tip(13, "Управление временем и стрессом. Научитесь выделять приоритеты и эффективно распоряжаться своим временем. Умение организовать свою деятельность помогает уменьшить чувство перегруженности и стресса, а также избежать выгорания."),
        Tip(14, "Будьте терпимы к себе. Не судите себя слишком строго за ошибки или неудачи. Все мы люди, и иногда нам нужно время, чтобы научиться и развиваться. Процесс роста часто включает в себя ошибки, но это не делает нас менее ценными."),
        Tip(15, "Создайте здоровую среду вокруг себя. Ваше окружение играет важную роль в вашем психоэмоциональном состоянии. Общение с поддерживающими и позитивными людьми помогает вам чувствовать себя уверенно и счастливо. Окружайте себя людьми, которые вдохновляют и поддерживают вас."),
        Tip(16, "Учитесь отпускать контроль. Порой мы стремимся контролировать все вокруг, включая людей и обстоятельства. Однако понимание того, что не все в нашей жизни поддается контролю, может существенно снизить уровень стресса и тревоги. Отпустите то, что вы не можете изменить, и сосредоточьтесь на том, что в ваших силах."),
        Tip(17, "Проблемы — это возможность для роста. Каждый кризис или трудная ситуация — это шанс для развития. Вместо того чтобы избегать сложностей, постарайтесь рассматривать их как вызов, который помогает вам стать сильнее и мудрее. Переписывание своего отношения к проблемам помогает преодолевать трудности с меньшими потерями."),
        Tip(18, "Практикуйте осознанность. Осознанность — это способность находиться в настоящем моменте, не отвлекаясь на прошлое или будущее. Это помогает уменьшить беспокойство и стресс, повысить уровень концентрации и улучшить качество жизни. Попробуйте простую практику: фокусируйтесь на своем дыхании в течение 5-10 минут в день."),
        Tip(19, "Позитивное общение. Умение выражать свои мысли и чувства без агрессии и осуждения помогает поддерживать здоровые отношения с другими людьми. Используйте 'я-выражения' вместо 'ты-выражений' — это позволяет избежать конфликта и создать атмосферу взаимопонимания."),
        Tip(20, "Не забывайте о своем отдыхе. Современный ритм жизни часто заставляет нас забывать о важности отдыха. Однако полноценный отдых — это не только физический отдых, но и психологический. Важно уделять время для расслабления, хобби и общения с близкими. Без отдыха наша психика и тело не могут полноценно функционировать."),
        Tip(21, "Учитесь просить о помощи. Многие из нас испытывают трудности с просьбой о помощи, считая это признаком слабости. На самом деле, попросить о поддержке — это проявление силы и умения заботиться о себе. Открытость и готовность к помощи укрепляют связи с окружающими и помогают справляться с трудностями."),
        Tip(22, "Развивайте чувство собственного достоинства. Уверенность в себе не приходит сама по себе, но ее можно развить через маленькие шаги: положительные аффирмации, признание своих достижений, отказ от самокритики. Когда вы уважаете себя, мир также начинает вас уважать."),
        Tip(23, "Будьте готовы к переменам. Жизнь постоянно меняется, и чем быстрее мы адаптируемся к этим изменениям, тем легче нам жить. Не бойтесь изменений, потому что именно они открывают новые возможности для роста и самопознания."),
        Tip(24, "Не пытайтесь угодить всем. Желание угодить всем может привести к внутреннему истощению и недовольству собой. Уважайте свои собственные желания и потребности, не ставя их в угоду окружающим. Вы не обязаны угождать всем — ваше счастье важнее."),
        Tip(25, "Позвольте себе радость. В повседневной суете мы часто забываем о простых удовольствиях жизни. Позвольте себе наслаждаться моментами радости — будь то чашка чая, встреча с другом или вечер в одиночестве с любимым фильмом. Это помогает наполнить жизнь смыслом и счастьем.")

    )

    fun getRandomTip(): Tip {
        return tips.random()
    }
}